app/Controllers/Barang.php

SELECT *
FROM `kategori`
---
    public function tambah()
    {
        $modelkategori = new Modelkategori();

        $data = [
            'datakategori' => $modelkategori->findAll()
        ];

INSERT INTO `barang` (`brgnama`, `id_penerima`, `brgstatus`, `brgcatatan`, `brggambar`, `brgkode`) VALUES ('Boneka cantik', '34', 'Masuk', 'Hadiah ulang tahun', '', '111')
---
                $pathGambar = '';
            }

            $this->barang->insert([
                'brgkode' => $kodebarang,
                'brgnama' => $namabarang,
                'id_penerima' => $kategori,
                'brgstatus' => $status,
                'brgcatatan' => $brgcatatan,
                'brggambar' => $pathGambar
            ]);

SELECT *
FROM `barang`
WHERE `brgkode` = '111'
SELECT *
FROM `kategori`
---
    public function edit($kode)
    {
        $cekData = $this->barang->where(array('brgkode' => $kode))->find();

        if ($cekData) {

            $modelkategori = new Modelkategori();

            $data = [
                'kodebarang' => $cekData[0]['brgkode'],
                'namabarang' => $cekData[0]['brgnama'],
                'kategori' => $cekData[0]['id_penerima'],
                'status' => $cekData[0]['brgstatus'],
                'catatan' => $cekData[0]['brgcatatan'],
                'datakategori' => $modelkategori->findAll(),