app/Controllers/Kategori.php

SELECT *
FROM `kategori`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `kategori`
---
    public function index()
    {
        $tombolcari = $this->request->getPost('tombolcari');

        if (isset($tombolcari)) {
            $cari = $this->request->getPost('cari');
            session()->set('cari_kategori', $cari);
            redirect()->to('/kategori/index');
        } else {
            $cari = session()->get('cari_kategori');
        }

        $dataKategori = $cari ? $this->kategori->cariData($cari)->paginate(5, 'kategori') : $this->kategori->paginate(5, 'kategori');

SELECT *
FROM `kategori`
WHERE `kategori`.`katid` = '31'
---
    public function formedit($id)
    {
        $rowData = $this->kategori->find($id);