app/Models/Modelbarang.php

    public function tampildata()
    {
        return $this->table('barang')->join('kategori', 'id_penerima=katid')->get();
---
SELECT *
FROM `barang`
JOIN `kategori` ON `id_penerima`=`katnama`